[
    {
        "title" :"application to read and publish my novel",
        "backgroundImg" :"/assets/projects/pandora.png",
        "projectURL" :"https://pandora-web-phi.vercel.app",
        "overview" :"I've developed a platform dedicated to sharing my personal novel, where I publish chapters for readers to enjoy. With integrated Google login functionality, users can easily access the content and enhance their reading experience. Once logged in, readers can interact with the chapters by liking, adding them to their favorites, and creating personalized read lists, all conveniently accessible from their profile page. Additionally, readers can engage with the story by leaving comments on each chapter, fostering a sense of community and connection within the platform.",
        "tecnologys" :"Nextjs, Firebase, TailwindCSS",
        "deploy" :"true"
    },
    {
        "title":"Netflix Clon",
            "backgroundImg":"/assets/projects/netflix.png",
            "projectURL":"https://netflix-clon-dun.vercel.app",
            "overview":"I created a Netflix-inspired project that goes beyond the basic streaming experience. This platform, developed using modern web technologies, allows users to explore an extensive library of movies and TV shows. It offers features such as watching trailers, user registration, and login, enhancing the overall entertainment experience. By integrating a robust movie API, users can dive into a world of diverse content, from trending releases to various genres and more. The platform's user-friendly design and advanced functionalities provide a seamless and enjoyable movie-watching experience.",
            "tecnologys":"Nextjs, TailwindCSS, Firebase",
            "deploy":"true"
    },
    {
        "title":"Gym App",
            "backgroundImg":"/assets/projects/gym.jpg",
            "projectURL":"https://github.com/JohanLeon0914/new-portfolio",
            "overview":"Application created for the management of your gym routines, I created this app so that you can design your own routines, save them and track the days in which you completed them, what exercises you did, repetitions and among other routine management options.",
            "tecnologys":"Nextjs, TailwindCSS, Firebase",
            "deploy":"false"
    },
    {
        "title":"Chatbot IA stream text",
            "backgroundImg":"/assets/projects/chatbot-ia.png",
            "projectURL":"https://chat-ai-kappa-one.vercel.app",
            "overview":"The chatbot app built in Next.js and using the Versel JDK for AI with OpenAI is an innovative solution that allows users to interact with a personalized virtual assistant, acting as if it were Johan León. Users can ask questions about contact information and receive immediate and accurate responses. OpenAI's AI technology enables real-time text generation through Stream String, ensuring that the chatbot generates responses instantly as users input their questions or queries. This provides a seamless and natural conversational experience. The user interface of the app is intuitive and user-friendly. Users can interact with the chatbot by simply typing their questions into the text box and receiving instant responses on the screen. The app can also provide personalized information about Johan León, such as contact details, professional experience, and other relevant details.",
            "tecnologys":"Nextjs, OpenAI, TailwindCSS, SDK IA Versel",
            "deploy":"true"
    },
    {
        "title":"Functional Chat",
            "backgroundImg":"/assets/projects/chat.png",
            "projectURL":"https://boomerland-private-chat.netlify.app/",
            "overview":"I've developed a functional chat application that allows users to log in and send real-time messages to both individual users and chat groups. The app also timestamps each message, providing a seamless and interactive chat experience.",
            "tecnologys":"Nextjs, Firebase, TailwindCSS",
            "deploy":"true"
    },
    {
        "title":"Ionic Store App",
            "backgroundImg":"/assets/projects/store-ionic.png",
            "projectURL":"https://github.com/JohanLeon0914/ionic-store",
            "overview":"Online store application that has a role system for administrators and customer users, where administrators can publish and edit products within the store and customers can view and add products to their shopping cart, and then buy them by generating a invoice for all products in your cart.",
            "tecnologys":"Angular, Ionic7, Firebase",
            "deploy":"false"
    },
    {
        "title":"Ionic Rick and Morty",
            "backgroundImg":"/assets/projects/ionic-ram.png",
            "projectURL":"https://github.com/JohanLeon0914/ionic-rick-and-morty",
            "overview":"The Ionic 7 and Angular app I created utilizes the Rick and Morty API to display characters. It features a search bar for easy character lookup and implements infinite scrolling. Users can search for their favorite characters by name, and as they type, the app dynamically filters the results. The infinite scrolling functionality allows for a seamless browsing experience, automatically fetching more character data as users scroll down the list. The app's interface is designed with Ionic 7's customizable UI components, ensuring a visually appealing and user-friendly experience. With just a tap, users can access detailed information about each character. In summary, this compact Ionic 7 and Angular app provides a convenient and immersive way for fans to explore the diverse cast of the Rick and Morty universe.",
            "tecnologys":"Angular, Ionic7",
            "deploy":"false"
    },
    {
        "title":"Task App ionic",
            "backgroundImg":"/assets/projects/task-app.png",
            "projectURL":"https://github.com/JohanLeon0914/ionic-task-app",
            "overview":"Task management application, in which you can mark task activities as done and see the progress of this task in the form of percentages. This app uses the firesotre cloud database and designed with ionic.",
            "tecnologys":"Angular, Ionic7, firebase",
            "deploy":"false"
    },
    {
        "title":"Chatbot IA: Ionic and Nodejs",
            "backgroundImg":"/assets/projects/chat-bot-ionic.png",
            "projectURL":"https://chat-ai-kappa-one.vercel.app",
            "overview":"A chatbot application which consumes a nodejs api that allows users to answer questions using the openai 3.5 natural language model, which is consumed by an app made with Ionic+Angular where the user can chat with this model.",
            "tecnologys":"Ionic, Angular, OpenAI, Nodejs",
            "deploy":"true"
    },
    {
        "title":"CryptoTracker",
            "backgroundImg":"/assets/projects/criptos.png",
            "projectURL":"https://angular-cryptomonedas.vercel.app",
            "overview":"An Angular application that can check prices and other data on cryptocurrencies with the help of an external API, has a search engine that filters cryptocurrencies.",
            "tecnologys":"Angular, TailwindCSS",
            "deploy":"true"
    },
    {
        "title":"WhatsApp Bot",
            "backgroundImg":"/assets/projects/bot-whatsapp2.png",
            "projectURL":"https://github.com/JohanLeon0914/bot-whatsapp-prueba",
            "overview":"A chatbot with AI that is able to answer questions depending on the business for which you want to adapt, people can enter the bot's chat and ask questions related to the context (mostly businesses) for which it is programmed.",
            "tecnologys":"Nodejs, OpenAI, @bot-whatsapp",
            "deploy":"false"
    },
    {
        "title":"Popetas Inventory",
            "backgroundImg":"/assets/projects/popetas.png",
            "projectURL":"https://crud-angular-firebase-5c874.web.app",
            "overview":"A login made with the Auth0 library and deployed with NodeJS, which allows the user to log in with google and be able to give and remove session permissions and provide user registration. With which he has developed other projects taking this as a basis for managing sessions and records within the applications.",
            "tecnologys":"Angular, Firebase, TailwindCSS",
            "deploy":"false"
    },
    {
        "title":"Login With Auth0",
            "backgroundImg":"/assets/projects/auth.webp",
            "projectURL":"https://github.com/JohanLeon0914/auth0Login",
            "overview":"An application made for managing the inventory of a microenterprise in my city, which allows the user to do CRUD of all their products that they have in the two branches of their business.",
            "tecnologys":"React, NodeJS, MySQL",
            "deploy":"false"
    },
    {
        "title":"Stripe Project",
            "backgroundImg":"/assets/projects/stripe.webp",
            "projectURL":"https://github.com/JohanLeon0914/stripe-react",
            "overview":"Website made in react and the use of a library called stripe, which allowed me to implement a credit card payment manager in different applications that I have created. It helps me to verify if a credit card is authentic.",
            "tecnologys":"React",
            "deploy":"false"
    },
    {
        "title":"CryptoBot",
            "backgroundImg":"/assets/projects/bot.png",
            "projectURL":"https://github.com/JohanLeon0914/frontend-cryptobot",
            "overview":"A telegram bot that allows users to track the cryptocurrencies of their preferences, so that the bot could send them news and price updates from time to time.",
            "tecnologys":"Nextjs, Firebase, Nodejs, TailwindCSS",
            "deploy":"false"
    }
]